{"meta":{"title":"ChinaToday","subtitle":"news from China","description":null,"author":"Redstar","url":"http://www.chinatoday.info"},"pages":[{"title":"about","date":"2017-08-03T19:44:05.000Z","updated":"2017-08-03T07:44:05.753Z","comments":true,"path":"about/index.html","permalink":"http://www.chinatoday.info/about/index.html","excerpt":"","text":""},{"title":"categories","date":"2017-08-03T19:37:51.000Z","updated":"2017-08-03T07:38:23.112Z","comments":false,"path":"categories/index.html","permalink":"http://www.chinatoday.info/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2017-08-03T19:44:39.000Z","updated":"2017-08-03T07:45:10.013Z","comments":false,"path":"tags/index.html","permalink":"http://www.chinatoday.info/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"China military experts,if India strategic misjudgment in the illegal cross-border issues, will be from the bitter taste.","slug":"yy","date":"2017-08-03T08:55:26.555Z","updated":"2017-08-03T08:55:26.551Z","comments":true,"path":"2017/08/03/yy/","link":"","permalink":"http://www.chinatoday.info/2017/08/03/yy/","excerpt":"China military experts:if India strategic misjudgment in the illegal cross-border issues, will be from the bitter taste. Data figure: Chinese army training lens","text":"China military experts:if India strategic misjudgment in the illegal cross-border issues, will be from the bitter taste. Data figure: Chinese army training lens Chinese sound “Defense Space” (Ji Mengnan) in Beijing in August 2, China Foreign Ministry issued a document “India border position” in the Sino Indian border crossing into the territory of the Sikkim section of Chinese facts and Chinese, this document to the international community to reveal what information? In the Indian army illegally across the border issue, India views what error? On related issues, “CNR defense time and space” reporter Ji Mengnan interviewed an associate professor of National Defense University’s International Defense Academy You Dongxiao. (Chinese military expert: if the strategic miscarriage of justice in India on illegal cross-border issues, will be suffering from the bitter pill.)China will take all necessary measures, including force, to safeguard national sovereigntyXiao Youdong told “CNR defense space-time” reporter, the Ministry of Foreign Affairs issued a position paper China systematically expounded China’s position in the long hole event and the jurisprudential basis, to expose the India in this event the wrong words and deeds, shows the strong determination of China to safeguard national sovereignty and territorial integrity.Xiao Youdong analysis, this paper revealed, China will take all necessary measures including the use of force to defend national sovereignty and territorial integrity is not violated. President Xi also pointed out to celebrate the important speech delivered by China people’s Liberation Army in 90th anniversary after the parade: I firmly believe that our army of heroes have the confidence and ability to defeat all the invading enemy! Our heroic army has the confidence and ability to safeguard state sovereignty, security and development interests!this incident occurred on the boundary between Sikkim and India, and was not delimited by territorial disputesYoudong Xiao pointed out that this incident is very clear in the border area is bound with the past, China and India border forces in the boundary region of the friction are essentially different. India border forces across the boundaries of Chinese violated the sovereignty and territorial integrity, not only violated the 1890 Chinese and Britain signed the “Sino British treaty conference Tibet India”, also in violation of the UN Charter and the basic norms of international law, the nature is very bad, so in this case the only solution is India immediately and unconditionally bound troops to the India side, which is the precondition and foundation to solve the problem of long hole event. Chinese military expert: if the strategic miscarriage of justice in India on illegal cross-border issues, will be suffering from the bitter pill.the reason why India has sent troops out of bounds is absurd; the border issue in China’s Bhutan has nothing to do with IndiaXiao pointed out that Youdong accept “CNR Defense Space” interview with reporters, said the India China “change the status quo, said he was” invited “to enter the cave of Bhutan Lang,” Bhutan maintenance interests “rhetoric absurd mistake, Its loopholes appeared one after another. India’s move is a serious violation of international law and upset the international order. India is acting on the basis of its strategic misjudgment of the Chinese side and will end up suffering from it. So far there is no legal basis, to provide military personnel to enter the cave area of India Langfirst, to other countries on their territory building action for their own safety constitutes a potential risk of sending troops into, this is a violation of the basic norms and principles of the UN Charter and international law, this is not any one sovereign tolerance.second, cave Lang region has always belonged to China, has been under the effective jurisdiction of China, there is no dispute.China and although Bhutan between the two sides of the boundary is not finalized, but the two sides have been carried out in the 24 round of border talks from the last century in 80s, has reached a broad consensus, India is now sending troops into the hole area it is not long, actually may see Chinese and Bhutan border agreement reached, deliberately making trouble in the relationship between China and Bhutan, it is claimed to be for the protection of Bhutan, but so far it did not produce any evidence or request to invite Bhutan troops to India to help it to protect the interests of the region shows that the long hole, it is untenable, in violation of international law. Chinese military expert: if the strategic miscarriage of justice in India on illegal cross-border issues, will be suffering from the bitter pill.Don’t I hope India strategic misjudgment, never China sovereignty and territorial issues.Xiao Youdong finally told reporters, “CNR National Defense Space” to remind India, don’t make strategic misjudgment, will back down in the hole that China Lang incident. Because they believe that China is now in the inside, the reform in depth and in-depth, especially in military reform, since the founding of new China in 1949, the largest and most comprehensive military reform. To the outside, the dispute between China and some neighboring maritime neighbors in island ownership and maritime rights and interests has not been resolved. As China grows stronger, the United States’s wariness and containment of China are becoming stronger, so Indians think China will definitely give in.I think that China has never made any compromise on the question of national sovereignty and territorial integrity, which is the bottom line of China and can not be overstepped. Therefore, if India based on this strategy misjudgment, continue to adhere to the policy in the hole Lang event, will be suffering in the future.","categories":[],"tags":[]},{"title":"","slug":"README","date":"2017-08-03T06:51:15.872Z","updated":"2017-08-03T06:51:15.864Z","comments":true,"path":"2017/08/03/README/","link":"","permalink":"http://www.chinatoday.info/2017/08/03/README/","excerpt":"Hipaper A fashional newspaper, blog theme for Hexo. ☞ 点击预览","text":"Hipaper A fashional newspaper, blog theme for Hexo. ☞ 点击预览 安装步骤 从Github上获取源码 1$ git clone https://github.com/iTimeTraveler/hexo-theme-hipaper.git themes/hipaper 启用主题 把Hexo主目录下 _config.yml 文件中的theme字段改为 hipaper，如下： 1234# Extensions## Plugins: http://hexo.io/plugins/## Themes: http://hexo.io/themes/theme: hipaper 更新到最新 12$ cd themes/hipaper$ git pull 特性支持图片Logo就像下面这样： 只用在hipaper/_config.yml中设置 avatar字段的eanble为true，然后设置图片的url就好了。 12345678# Put your avatar.jpg into `hexo-site/themes/hipaper/source/` directory.# url is target link (E.g. `url: https://hexo.io/logo.svg` or `url: css/images/mylogo.jpg`)avatar: enable: true width: 124 height: 124 bottom: 10 url: https://hexo.io/logo.svg 代码高亮Hipaper 使用 Tomorrow Theme 作为代码主题. 共有以下六种选项: default, normal, night, night blue, night bright, night eighties 默认高亮配色如上图， 另外的五种配色如下. 您可以在本主题的 hipaper/_config.yml 文件中更改 highlight_theme 字段. 12345# Code Highlight theme# Available value:# default | normal | night | night eighties | night blue | night bright# https://github.com/chriskempson/tomorrow-themehighlight_theme: default 侧边栏主题_config.yml文件中的 sidebar 字段可以设置为 left或right，用来控制侧边栏显示在页面左侧还是右侧。Hipaper 拥有以下7种侧边栏组件: search （搜索框） social （社交网站链接） recent_posts （最新文章） category （分类） tag （标签） tagcloud （标签云） archive （归档栏） 以上组件在主题中均已默认启用.您可以在 widget 字段中设置显示哪些以及顺序。 站内搜索Hipaper 使用 Insight Search 来帮助大家使用站内搜索. 12345# Searchsearch: insight: true # you need to install `hexo-generator-json-content` before using Insight Search swiftype: # enter swiftype install key here baidu: false # you need to disable other search engines to use Baidu search, options: true, false ！！注意: 使用搜索工具之前您必须使用 hexo-generator-json-content 来安装，在Hexo根目录下执行命令如下： 1$ npm install -S hexo-generator-json-content FancyboxHipaper 使用 Fancybox 来提供文章图片预览. 123![img caption](img url)&#123;% fancybox img_url [img_thumbnail] [img_caption] %&#125; 评论功能Hipaper 已完全支持原生的多说、 Disqus评论功能. 您可以在 hipaper/_config.yml 文件中更改以下字段: 123# comment ShortName, you can choose only ONE to display.duoshuo_shortname: iTimeTravelerdisqus_shortname: 支持的浏览器 贡献 本主题源于Wordpress作者 ATHEMES, 原生主题点击查看 FASHIONISTA for Wordpress. 大家有各种问题和改进建议的，直接提issue或者评论，或者pull request都行。我会尽量抽时间和大家交流。刚接触Hexo不久，疏忽不足之处，还望大家海涵！ LicenseHipaper is under the MIT license. See the LICENSE file for details.","categories":[],"tags":[]},{"title":"","slug":"haha","date":"2017-08-02T10:31:49.686Z","updated":"2017-08-02T10:31:49.686Z","comments":true,"path":"2017/08/02/haha/","link":"","permalink":"http://www.chinatoday.info/2017/08/02/haha/","excerpt":"","text":"xxxxxxxxxxxxxxxxxxxx","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2017-08-02T10:18:31.980Z","updated":"2017-08-02T10:18:31.980Z","comments":true,"path":"2017/08/02/hello-world/","link":"","permalink":"http://www.chinatoday.info/2017/08/02/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}